[{"word": "paycheck", "definition": "A bank check in payment of wages or salary."}, {"word": "ask around", "definition": "To try to find out something by asking people of one's acquaintance the same question."}, {"word": "tablespoon", "definition": "An amount equal to one half of a fluid ounce or three teaspoons."}, {"word": "ask out", "definition": "To invite (someone) to go out on a date."}, {"word": "newspaper", "definition": "A publication made of several large sheets of folded paper printed with news, opinions, advertisements, and other information."}, {"word": "break away", "definition": "Of a theatrical or film prop, designing to break under slight impact, as a balsa-wood chair."}, {"word": "movie theatre", "definition": "A building where people go to see movies on a large screen."}, {"word": "bus stop", "definition": "A place along a bus route where the bus will stop to let people get on or off the bus."}, {"word": "superstar", "definition": "A widely popular performer, as in sports, films, or rock music."}, {"word": "car pool", "definition": "An agreement among a group of automobile drivers who work together, or whose children go to the same school."}, {"word": "catfish", "definition": "A  fish with no scales and a large head, found mostly in fresh water."}, {"word": "cell membrane", "definition": "The semipermeable membrane that encloses the contents of a cell; plasma membrane."}, {"word": "sailboat", "definition": "A boat pushed by wind blowing against its sails."}, {"word": "christmas tree", "definition": "A real or artificial evergreen tree, usually placed indoors and decorated with lights and ornaments at christmas."}, {"word": "bodyguard", "definition": "A person whose job is to protect another person or a group of people from harm."}, {"word": "coffee shop", "definition": "A small restaurant that specializes in serving coffee, snacks, and light meals."}, {"word": "waistcoat", "definition": "A close-fitting, sleeveless, waist-length garment for women, usually worn under a suit jacket."}, {"word": "common sense", "definition": "Ordinary good judgment in everyday matters."}, {"word": "lighthouse", "definition": "A tower with a flashing light for guiding ships and warning them of dangers in the water."}, {"word": "cream cheese", "definition": "A rich, soft, smooth white cheese made of milk and sometimes cream, and not ripened."}, {"word": "runway", "definition": "A smooth, level strip on which airplanes take off and land."}, {"word": "credit card", "definition": "A card from a bank or store that lets a person buy things and pay for them later."}, {"word": "caveman", "definition": "A human being who lived in a cave thousands of years ago; cave dweller."}, {"word": "dance hall", "definition": "A usually public establishment that charges an admission price and provides space, music, and sometimes partners for dancing."}, {"word": "starfish", "definition": "A sea animal with a flat body and five or more arms."}, {"word": "debit card", "definition": "A card issued by the holder's bank used to pay for purchases or withdraw money by an immediate electronic debiting of funds on deposit in the holder's bank account, and often also allowing transactions at an atm machine."}, {"word": "lifetime", "definition": "The time during which a person's life goes on."}, {"word": "fill in", "definition": "To give or write down information."}, {"word": "toothbrush", "definition": "A brush with a short, narrow head and a long handle used to clean the teeth."}, {"word": "fill out", "definition": "To complete by giving missing information."}, {"word": "uplift", "definition": "To improve the spiritual, moral, or social condition or mood of."}, {"word": "fire drill", "definition": "A practice exercise covering what to do in case of a fire, either in combating the fire or in escaping from it."}, {"word": "railroad", "definition": "A road of steel rails upon which train cars travel."}, {"word": "fire drill", "definition": "A practice exercise covering what to do in case of a fire, either in combating the fire or in escaping from it."}, {"word": "needle work", "definition": "Work done with a needle and thread as decoration; embroidery."}, {"word": "first aid", "definition": "Emergency medical help given to a hurt or sick person while waiting for a doctor."}, {"word": "strawberry", "definition": "A red, juicy fruit with seeds on the outside."}, {"word": "full moon", "definition": "The moon when it is on the side of earth that is opposite the sun and looks from earth like a complete circle."}, {"word": "nobody", "definition": "No one; no person; not anybody."}, {"word": "high school", "definition": "A school that begins with grades nine or ten and ends with grade twelve."}, {"word": "hopscotch", "definition": "A children's game in which players toss a stone onto a pattern of numbered squares drawn on the ground."}, {"word": "hot dog", "definition": "A hot, cooked sausage, sometimes called a frankfurter, eaten in a long, soft roll."}, {"word": "crosswalk", "definition": "A lane or path in a road that is marked off for people to cross on foot."}, {"word": "ice cream", "definition": "A rich, sweet, frozen food made by mixing cream and milk products."}, {"word": "goldfish", "definition": "A small fish that lives in fresh water."}, {"word": "ice cube", "definition": "One of the small, usually cube-shaped, pieces of ice made by freezing water in a divided tray, which may be added to drinks or packed around things to keep them cold; ice."}, {"word": "sunburn", "definition": "A sore redness of the skin caused by staying in the sun too long."}, {"word": "ice hockey", "definition": "A sport played on ice by two teams."}, {"word": "groundhog", "definition": "Another name for a woodchuck."}, {"word": "jumping jack", "definition": "A continuous exercise in which one moves the legs apart and the arms above the head with one jump, then brings the legs together and the arms to the sides with the next."}, {"word": "fisherman", "definition": "Someone who catches fish either as a sport or as a way to make a living."}, {"word": "living room", "definition": "A room in a home in which people can relax or gather together."}, {"word": "outer space", "definition": "Region beyond the atmosphere of the earth."}, {"word": "police officer", "definition": "A person who is a member of a police force."}, {"word": "handshake", "definition": "The gripping and shaking of hands between two people when they meet or say good-bye."}, {"word": "post office", "definition": "A department or branch of a government responsible for handling mail."}, {"word": "desktop", "definition": "The flat, upper working surface of a desk."}, {"word": "radio wave", "definition": "An electromagnetic wave with a wavelength of between one millimeter and thirty thousand meters, or a frequency of between ten kilohertz and three hundred thousand megahertz."}, {"word": "timekeeper", "definition": "An official in an athletic contest who regulates, keeps track of, or records the time for an event or each section of a game."}, {"word": "real estate", "definition": "An area of land, including the trees, water, and buildings on it."}, {"word": "keyboard", "definition": "A row or rows of keys."}, {"word": "report card", "definition": "A written report of a student's progress in school that is usually sent to the student's home."}, {"word": "rollout", "definition": "A football play in which the quarterback runs rapidly to one side rather than straight back before throwing a pass."}, {"word": "roller coaster", "definition": "An amusement park ride in which a train of open cars rides up and down a winding track."}, {"word": "uptown", "definition": "Toward or in the higher, wealthier, or more northern part of a city or town."}, {"word": "rubber band", "definition": "A narrow loop of rubber used to hold objects together."}, {"word": "spearmint", "definition": "A common mint plant."}, {"word": "science fiction", "definition": "A kind of fiction writing that is often about people living in the far future or about life on other planets or in other galaxies."}, {"word": "dropdown", "definition": "A menu in a computer program interface whose title is visible but whose contents are revealed only when the title is clicked on, allowing a user to choose an item on the menu."}, {"word": "sugar plum", "definition": "A small, flavored sugar candy, especially in the shape of a ball."}, {"word": "candlestick", "definition": "A holder for one or more candles."}, {"word": "sweet tooth", "definition": "(informal) a liking or craving for candy, cookies, or other foods with a high sugar content."}, {"word": "rainbow", "definition": "A curved arc of light of many colors across the sky."}, {"word": "swimming pool", "definition": "A large man-made pool that is filled with water and used for swimming."}, {"word": "video game", "definition": "A game played on a television or computer in which players control what happens."}, {"word": "table cloth", "definition": "A cloth laid over a dining table to protect its surface during a meal."}, {"word": "waterproof", "definition": "Not letting water through; not absorbent."}, {"word": "take away", "definition": "To remove (something) from a person, animal, or place."}, {"word": "angelfish", "definition": "Any of several types of related tropical fishes having bright colors, winglike fins, and short, circular bodies."}, {"word": "take out", "definition": "Having to do with food that is eaten some place other than where it was made."}, {"word": "birdhouse", "definition": "Something constructed by humans as a place for a bird to build its nest."}, {"word": "tea cup", "definition": "A small cup, usually used for serving tea or the like."}, {"word": "doorbell", "definition": "A bell on an outside door that is rung by a person who wants to be let inside."}, {"word": "turn in", "definition": "To give or return something to an official person."}, {"word": "keyhole", "definition": "A hole in a lock into which a key is put to lock and unlock it."}, {"word": "vice president", "definition": "An officer who ranks directly below a president."}, {"word": "firefighter", "definition": "Someone who fights fires, either for pay or as a volunteer."}, {"word": "video game", "definition": "A game played on a television or computer in which players control what happens."}, {"word": "eyeball", "definition": "The part of the eye that is shaped like a ball."}, {"word": "web page", "definition": "A document belonging to a website on the world wide web."}]